export const HOME = '/';
export const IMAGES_PATH = 'src/assets/images/';

const VITE_BASE_URL = import.meta.env.VITE_BASE_URL;
const VITE_KEYCLOAK_URL = import.meta.env.VITE_KEYCLOAK_URL;

export const BASE_URL = VITE_BASE_URL || 'http://localhost:8090/api';
export const KEYCLOAK_URL = VITE_KEYCLOAK_URL || 'http://localhost:8080/';

export const COUNTRIES = [
    "مصر", "السعودية", "ليبيا", "العراق", "الاردن", "الكويت", "البحرين", "الامارات",
    "عمان", "تونس", "الجزائر", "المغرب", "السودان", "الصومال", "الهند", "باكستان",
    "بنجلاديش", "فلسطين", "لبنان", "سوريا", "اليمن", "نيجريا", "روسيا", "تركيا",
    "جنوب أفريقيا", "ألمانيا", "انجلترا", "ايرلندا", "امريكا", "اسبانيا", "استراليا",
    "كندا", "قطر", "الصين", "افغانستان", "كينيا", "بوليفيا", "زيمبابوى", "بورتريكو",
    "مينمار", "نيبال", "ماليزيا", "غانا", "سيريلانكا", "كردستان", "اثيوبيا", "السويد",
    "رومانيا", "ايران", "المالديف", "كوت دى فوار", "ارمينيا", "اوكرنيا", "فنلندا",
    "بيرو", "جاميكا", "تشاد", "بوتسوانا", "البانيا", "اندونسيا", "البرازيل", "بيلاروسيا",
    "اوغندا", "هولندا", "تركمنستان", "فرنسا", "صربيا", "سنغافوره", "مالطا", "بورونى",
    "ترينداد وتوباجو", "المكسيك", "اليابان", "اذربيجان", "اليونان", "ليبريا", "تنزانيا",
    "جورجيا", "فيتنام", "الجابون", "النمسا", "سيراليون", "النيجر", "لوكسمبورج", "سوايزلاند",
    "سانت فينسنت", "دومينيكان", "ايطاليا", "بلجيكا", "موريتانيا", "الارجنتين", "موزمبيق",
    "زامبيا", "جيبوتي", "البرتغال", "سيشل", "جزر كايمان", "بروناي", "سويسرا", "بوتان",
    "رواندا", "ليتوانيا", "كولومبيا", "مالي", "بلغاريا", "الفلبين", "كازاخستان",
    "الغابون", "مقدونيا", "كوسفو", "التشيك", "الدنمارك", "سلوفاكيا", "أفريقيا الوسطى",
    "أخرى وضحها"
];


export const NATIONALITIES = [
    "مصري", "سعودي", "ليبيا", "عراقي", "الاردن", "الكويت", "البحرين", "الامارات",
    "عمان", "تونس", "الجزائر", "المغرب", "السودان", "الصومال", "الهند", "باكستان",
    "بنجلاديش", "فلسطين", "لبنان", "سوريا", "اليمن", "نيجريا", "روسيا", "تركيا",
    "جنوب أفريقيا", "ألمانيا", "انجلترا", "ايرلندا", "امريكا", "اسبانيا", "استراليا",
    "كندا", "قطر", "الصين", "افغانستان", "كينيا", "بوليفيا", "زيمبابوى", "بورتريكو",
    "مينمار", "نيبال", "ماليزيا", "غانا", "سيريلانكا", "كردستان", "اثيوبيا", "السويد",
    "رومانيا", "ايران", "المالديف", "كوت دى فوار", "ارمينيا", "اوكرنيا", "فنلندا",
    "بيرو", "جاميكا", "تشاد", "بوتسوانا", "البانيا", "اندونسيا", "البرازيل", "بيلاروسيا",
    "اوغندا", "هولندا", "تركمنستان", "فرنسا", "صربيا", "سنغافوره", "مالطا", "بورونى",
    "ترينداد وتوباجو", "المكسيك", "اليابان", "اذربيجان", "اليونان", "ليبريا", "تنزانيا",
    "جورجيا", "فيتنام", "الجابون", "النمسا", "سيراليون", "النيجر", "لوكسمبورج", "سوايزلاند",
    "سانت فينسنت", "دومينيكان", "ايطاليا", "بلجيكا", "موريتانيا", "الارجنتين", "موزمبيق",
    "زامبيا", "جيبوتي", "البرتغال", "سيشل", "جزر كايمان", "بروناي", "سويسرا", "بوتان",
    "رواندا", "ليتوانيا", "كولومبيا", "مالي", "بلغاريا", "الفلبين", "كازاخستان",
    "الغابون", "مقدونيا", "كوسفو", "التشيك", "الدنمارك", "سلوفاكيا", "أفريقيا الوسطى",
    "أخرى وضحها"
];


export const COURSE_PARTS = [
    "1", "2", "3", "Rev"]


export const TRUE_FALSE_OPTIONS = [
    "Yes", "No"
]

export const CURRENCIES = [
    "AED", "USD", "EGP"
]
export const RATINGS = [
    "Bad", "Good", "V Good", "Exellent"

]